---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CouplerMainEngagement
source: html/15f9366f-e1e2-e28b-39cc-c96e4fa78a6c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CouplerMainEngagement Property

"Bar Engagement 1"

## Syntax (C#)
```csharp
public static ForgeTypeId CouplerMainEngagement { get; }
```